import Link from 'next/link'

const Notice = () => {
  return (
      <section className="noticePage">
          <div className="noticeContainer">
              <h2>공지사항</h2>
              <div>
                  <ul className="notice_ul">
                      <Link href="" as="">
                            <a>
                                <li>공지사항입니다.</li>
                            </a>
                      </Link>

                      <Link href="" as=""><a><li>2022 공지사항입니다.</li></a></Link>

                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>

                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>

                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>
                      
                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>
                      
                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>

                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>

                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>

                      <Link href="" as=""><a><li>공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다.공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다공지사항 제목이 노출됩니다. 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다 최대 한줄까지 노출 됩니다</li></a></Link>
                  </ul>
                  <button> + 더보기</button>
              </div>
          </div>
      </section>
  );
}

export default Notice;